/*******************************************************************************
 Copyright (C),2002-2014, NewGreenNet Tech.  Co . ,  Ltd.
 文件名称: vrrpFuncParse.h
 描述: 提供其它进程调用的库函数使用vrrp模块的参数传递机制进行，此文件完成解析
     从库函数传递过来的消息流并调用相应的处理函数。
 修订记录：
 修订1：
*******************************************************************************/
/***********************************头文件*************************************/
#ifndef _INCLUDE_VRRPFUNCPARSE_H_
#define _INCLUDE_VRRPFUNCPARSE_H_

#include <libipc/vosMsg.h>
#include <libipc/smdMsgRequest.h>

/***********************************数据***************************************/

/***********************************函数***************************************/

/******************************************************************************
函数名称：vrrpAppWrapFunction
功能描述：注册库函数消息流解析函数
输入参数：无
输出参数：无
函数返回：VD_E_NONE, 成功
          VD_E_FAIL，执行失败
          VD_E_PARAM，参数错误  
其它说明：在进程接收消息之前调用
******************************************************************************/
int vrrpAppWrapFunction(void);
int vrrpAppWrapProcess(SMD_MSG *pMsg);

#endif /*_INCLUDE_VRRPFUNCPARSE_H_*/

